Revit 2027 API
BuiltInFailures.OverlapFailures.WallsOverlap Property
 Highlighted walls overlap. One of them may be ignored when Revit finds room boundaries. Use Cut Geometry to embed one wall within the other.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallsOverlap { get; }
Public Shared ReadOnly Property WallsOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallsOverlap {
	FailureDefinitionId^ get ();
}
static member WallsOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace